PC5-duese/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
#include        "../BCDict"
internalField   uniform $k;

boundaryField
{
    casing
    {
        type            kqRWallFunction;
        value           uniform $k;
    }
    inlet
    {
        type            fixedValue;
        value           uniform $k;
    }
    nozzle
    {
        type            fixedValue;
        value           uniform $k_nozzle;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
